# Nurbs Surface Data Get Number Of Control Points Method

Source: https://www.revitapidocs.com/2026/b9d370fe-bb76-9ac4-6fe1-9d6f7348b83e.htm

---

| Nurbs Surface Data Get Number Of Control Points Method |
| --- |

Get the number of control points.
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public int GetNumberOfControlPoints()
```

```
Public Function GetNumberOfControlPoints As Integer
```

```
public:
int GetNumberOfControlPoints()
```

```
member GetNumberOfControlPoints : unit -> int
```

#### Return Value

Int32 See Also

#### Reference

NurbsSurfaceData Class Autodesk.Revit.DB Namespace